* TODO Integration tests
* TODO Plain text format
* DONE Batch YouTube API requests
CLOSED: [2021-02-16 Tue 00:00]
:LOGBOOK:
CLOCK: [2021-02-15 Mon 22:45]--[2021-02-16 Tue 00:00] =>  1:15
CLOCK: [2021-02-09 Tue 22:05]--[2021-02-09 Tue 23:00] =>  0:55
:END:
* DONE Separate table for channel id -> channel name mapping
CLOSED: [2021-01-24 Sun 16:30]
* TODO Store JSON as blob for easy migrations and extensions
* TODO Record timestamp when video is added/watched
* DONE Use Caqti_async as database library
CLOSED: [2021-01-24 Sun 02:49]
:LOGBOOK:
CLOCK: [2021-01-22 Fri 16:15]--[2021-01-22 Fri 19:03] =>  2:48
:END:
[[https://paurkedal.github.io/ocaml-caqti/caqti-async/Caqti_async/module-type-CONNECTION/index.html][Caqti_async.Connection]] supports transactions and async operations.
* DONE Automatically refresh OAuth token when necessary
CLOSED: [2021-01-22 Fri 19:05]
* TODO Add custom user tags to database
Could be used as individual sublists to watch later
* DONE Set journaling mode to WAL
CLOSED: [2021-02-18 Thu 00:49]
* DONE Auto-generate schema file
CLOSED: [2021-02-18 Thu 00:29]
:LOGBOOK:
CLOCK: [2021-02-17 Wed 23:41]--[2021-02-18 Thu 00:29] =>  0:48
:END:
* TODO ETag-based caching
https://developers.google.com/youtube/v3/getting-started#etags
